# Objective

review core 'pandas' objects: `pandas.Series` and `panda.DataFrame`

# `pandas`
- Python package to wrangle and analyze tabular dara
- built on top of Numpy
- core tool for data analysis in Python

In [2]:
#import pandas with standards abbreviation
import pandas as pd

#import numpy too!
import numpy as np

# Series 

A `pandas.Series`:

- is one of the core data structures in `pandas`
- a 1-dimensional array of *indexed* data
- will be the columns of the `pandas.DataFrame`

# Creating a pandas Series 

Several ways of creating a pandas Series. 
For now, we will create series using:

```
s = pd.Series(data, index=index)
```

- `data` = a numpy array (or a list of objects that can be converted to Numpy types)
- `index` = a list of indices of same length as data

In [4]:
# Example: a pandas series from a numpy array

#np.arrange() function constructs an array of consecutive integers
np.arange(3)

array([0, 1, 2])

In [5]:
# we can use this to create a pandas Series
pd.Series(np.arange(3), index=['a', 'b', 'c'])

a    0
b    1
c    2
dtype: int64

What kind of parameter is `index`?

A: an optional parameter, there is a default value to it.

If we don't specify `index`, the default is to start the index from 0.

Example:

In [6]:
#create a series from a list of strings with default index
pd.Series(['EDS 220','EDS 222', 'EDS 223', 'EDS 242'])

0    EDS 220
1    EDS 222
2    EDS 223
3    EDS 242
dtype: object

# Operation of Series 

Arithmetic operations work on series on also most Numpy functions.

Example:

In [9]:
#define series, and when print create an empty line in between
s = pd.Series([98, 73, 65], index=['Andrea', 'Beth', 'Caroline'])
print(s, '\n')

# divide each element in the series by 10:
print(s/10)

Andrea      98
Beth        73
Caroline    65
dtype: int64

Andrea      9.8
Beth        7.3
Caroline    6.5
dtype: float64

Example: create a new series with `true`\`false` values indicating whether the elements in the series satisfy a condition or not.

In [10]:
# identifying wether the value is > than 70
s>70

Andrea       True
Beth         True
Caroline    False
dtype: bool

This is simple -- but important!! Using conditions on Series is key to select data from dataframes.

## Attributes & Methods

Two examples about identifying missing values.

- missing values in `pandas` are represented by `np.NaN` = not a number 
- `NaN` is a type of float in numpy

In [11]:
np.NaN

nan

In [12]:
type(np.NaN)

float

In [14]:
#series with NAs in it:
s = pd.Series([1,2, np.NaN, 4, np.NaN])
s

0    1.0
1    2.0
2    NaN
3    4.0
4    NaN
dtype: float64

`hasnans` = attributes of pandas series, returns `True` if there are any Nans

In [15]:
#check if series has Nans
s.hasnans

True

`isna()` = a method of series, returns a series indicating which elements are NAs:

In [16]:
s.isna()

0    False
1    False
2     True
3    False
4     True
dtype: bool

# Dataframes

`pandas.DataFrame`:

- most used object in `pandas`
- represents tabular data (think of a spreadsheet)
- each column is a `panda.Series`

# Creating a `pandas.DataFrame`
*Many ways of creating a dataframe*. Let's see one.

Remember dictionaries? They are sets of key-value pairs:
```
{key1: value1,
    key2 : value2
    }
```

Think of a `pd.DataFrame` as a dictionary where:
- `keys` = column names
- `values` = column values 

We can create a data frame like this:

In [17]:
#initialize dictionary with columns' data
d = {'col_name_1' : np.arange(3),
    'col_name_2' : [3.1,3.2,3.3]
    }
d

{'col_name_1': array([0, 1, 2]), 'col_name_2': [3.1, 3.2, 3.3]}

In [18]:
# create data frame 
df = pd.DataFrame(d)
df

   col_name_1  col_name_2
0           0         3.1
1           1         3.2
2           2         3.3

# In place Operations 
Let's rename the data frame's columns.
We can use a dataframe *method* called `rename`,
`rename` takes in as an input a dictionary:

```
{ 'col_old_name_1' : 'col_new_name_1',
  'col_old_name_2' : 'col_new_name_2',
}
```

In [19]:
# define new column names 
col_names = {'col_name_1': 'col1',
             'col_name_2': 'col2'
            }

#rename using rename
df.rename(columns = col_names)

   col1  col2
0     0   3.1
1     1   3.2
2     2   3.3

In [20]:
# take a look at our dataframe
df

   col_name_1  col_name_2
0           0         3.1
1           1         3.2
2           2         3.3

Nothing changed!
`df.rename()` does not change the column names *in place*, meaning it does not modify the object itself. Insteadm it created a new object as an output.

Assign putput back to dataframe to actually change it:

In [21]:
df = df.rename(columns = col_names)
df

   col1  col2
0     0   3.1
1     1   3.2
2     2   3.3